---
kind: property
id: P:Autodesk.Revit.DB.FabricationConfigurationInfo.GUID
source: html/b42050aa-c8a8-9591-6dee-6cd952c4a0ec.htm
---
# Autodesk.Revit.DB.FabricationConfigurationInfo.GUID Property

The unique identification of the fabrication configuration.

## Syntax (C#)
```csharp
public Guid GUID { get; }
```